resource/request_file/BajajAllianz_Car_Pdf.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:baj="http://bajaj.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <baj:downloadFile>
         <arg0>
            <!--Optional:-->
            <errorCode></errorCode>
            <!--Optional:-->
            <errorMsg></errorMsg>
            <!--Optional:-->
            <password>___insurer_integration_service_password___</password>
            <!--Optional:-->
            <pdfMode>WS_POLICY_PDF</pdfMode>
            <!--Optional:-->
            <policyNum>___dbmaster_insurer_transaction_identifier___</policyNum>
            <!--Optional:-->
            <str1></str1>
            <!--Optional:-->
            <str10></str10>
            <!--Optional:-->
            <str11></str11>
            <!--Optional:-->
            <str12></str12>
            <!--Optional:-->
            <str13></str13>
            <!--Optional:-->
            <str14></str14>
            <!--Optional:-->
            <str15></str15>
            <!--Optional:-->
            <str2></str2>
            <!--Optional:-->
            <str3></str3>
            <!--Optional:-->
            <str4></str4>
            <!--Optional:-->
            <str5></str5>
            <!--Optional:-->
            <str6></str6>
            <!--Optional:-->
            <str7></str7>
            <!--Optional:-->
            <str8></str8>
            <!--Optional:-->
            <str9></str9>
            <!--Optional:-->
            <userId>___insurer_integration_service_user___</userId>
         </arg0>
      </baj:downloadFile>
   </soapenv:Body>
</soapenv:Envelope>